:PROPERTIES:
:ID:       2b5f2b28-4a45-42e4-b009-9ca295f726c4
:ROAM_REFS: https://youtu.be/xcygqF5LVmM?t=342
:END:
#+title: Rust data types
#+filetags: rust

*** null pointer optimization
:PROPERTIES:
:ID:       1578850d-d7d8-4f9c-8aa4-18fca46ff5c2
:ROAM_REFS: https://stackoverflow.com/questions/46557608/what-is-the-null-pointer-optimization-in-rust
:END:
if an enum has two variants, where one variant has no associated data, and the other variant has associated data where the bit pattern of all zeros isn't a valid value, then the enum itself will take exactly the same amount of space as that associated value, using the all zeroes bit pattern to indicate that it's the other variant.
#+begin_src rust
enum Foo {
    A,
    B(ContainsANonNullPtr),
}
#+end_src
the null pointer optimization kicks in, which eliminates the space needed for the tag. If the variant is A, the whole enum is set to all 0's. Otherwise, the variant is B. This works because B can never be all 0's, since it contains a non-zero pointer
#+begin_src rust :exports both
pub enum WithNullPtrOptimization{
    A,
    B(String),
}

pub enum WithoutNullPtrOptimization{
    A,
    B(u32),
}

fn main()  {
    println!("{} {}", std::mem::size_of::<WithNullPtrOptimization>(), std::mem::size_of::<String>()); // 24 24
    println!("{} {}", std::mem::size_of::<WithoutNullPtrOptimization>(), std::mem::size_of::<u32>()); // 8 4
}
#+end_src

#+RESULTS:
: 24 24
: 8 4
It means =&=, =&mut=, =Box=, =Rc=, =Arc=, =Vec=, and several other important types in Rust have no overhead when put in an =Option=
